#pragma once

/**
 * Name: UpGun
 * Version: 0.5
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function BP_Deathmatch_DeathCamera.BP_Deathmatch_DeathCamera_C.InpAxisEvt_LookUp_K2Node_InputAxisEvent_1
	 */
	struct ABP_Deathmatch_DeathCamera_C_InpAxisEvt_LookUp_K2Node_InputAxisEvent_1_Params
	{
	public:
		float                                                      AxisValue;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_Deathmatch_DeathCamera.BP_Deathmatch_DeathCamera_C.InpAxisEvt_Turn_K2Node_InputAxisEvent_2
	 */
	struct ABP_Deathmatch_DeathCamera_C_InpAxisEvt_Turn_K2Node_InputAxisEvent_2_Params
	{
	public:
		float                                                      AxisValue;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_Deathmatch_DeathCamera.BP_Deathmatch_DeathCamera_C.ReceiveTick
	 */
	struct ABP_Deathmatch_DeathCamera_C_ReceiveTick_Params
	{
	public:
		float                                                      DeltaSeconds;                                            // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_Deathmatch_DeathCamera.BP_Deathmatch_DeathCamera_C.ExecuteUbergraph_BP_Deathmatch_DeathCamera
	 */
	struct ABP_Deathmatch_DeathCamera_C_ExecuteUbergraph_BP_Deathmatch_DeathCamera_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_4DCY[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
