#pragma once

/**
 * Name: UpGun
 * Version: 0.5
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.AreCosmeticsUpdated
	 */
	struct ACharacterePrevisCustom_C_AreCosmeticsUpdated_Params
	{
	public:
		bool                                                       Updated;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.UserConstructionScript
	 */
	struct ACharacterePrevisCustom_C_UserConstructionScript_Params
	{	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.Boing__FinishedFunc
	 */
	struct ACharacterePrevisCustom_C_Boing__FinishedFunc_Params
	{	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.Boing__UpdateFunc
	 */
	struct ACharacterePrevisCustom_C_Boing__UpdateFunc_Params
	{	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.Spin__FinishedFunc
	 */
	struct ACharacterePrevisCustom_C_Spin__FinishedFunc_Params
	{	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.Spin__UpdateFunc
	 */
	struct ACharacterePrevisCustom_C_Spin__UpdateFunc_Params
	{	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.OnNotifyEnd_510764A04CE91D20BB875CB61A99C2E0
	 */
	struct ACharacterePrevisCustom_C_OnNotifyEnd_510764A04CE91D20BB875CB61A99C2E0_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.OnNotifyBegin_510764A04CE91D20BB875CB61A99C2E0
	 */
	struct ACharacterePrevisCustom_C_OnNotifyBegin_510764A04CE91D20BB875CB61A99C2E0_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.OnInterrupted_510764A04CE91D20BB875CB61A99C2E0
	 */
	struct ACharacterePrevisCustom_C_OnInterrupted_510764A04CE91D20BB875CB61A99C2E0_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.OnBlendOut_510764A04CE91D20BB875CB61A99C2E0
	 */
	struct ACharacterePrevisCustom_C_OnBlendOut_510764A04CE91D20BB875CB61A99C2E0_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.OnCompleted_510764A04CE91D20BB875CB61A99C2E0
	 */
	struct ACharacterePrevisCustom_C_OnCompleted_510764A04CE91D20BB875CB61A99C2E0_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.OnNotifyEnd_963433F44BA515CA8BCB8A81A4BF77E9
	 */
	struct ACharacterePrevisCustom_C_OnNotifyEnd_963433F44BA515CA8BCB8A81A4BF77E9_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.OnNotifyBegin_963433F44BA515CA8BCB8A81A4BF77E9
	 */
	struct ACharacterePrevisCustom_C_OnNotifyBegin_963433F44BA515CA8BCB8A81A4BF77E9_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.OnInterrupted_963433F44BA515CA8BCB8A81A4BF77E9
	 */
	struct ACharacterePrevisCustom_C_OnInterrupted_963433F44BA515CA8BCB8A81A4BF77E9_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.OnBlendOut_963433F44BA515CA8BCB8A81A4BF77E9
	 */
	struct ACharacterePrevisCustom_C_OnBlendOut_963433F44BA515CA8BCB8A81A4BF77E9_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.OnCompleted_963433F44BA515CA8BCB8A81A4BF77E9
	 */
	struct ACharacterePrevisCustom_C_OnCompleted_963433F44BA515CA8BCB8A81A4BF77E9_Params
	{
	public:
		class FName                                                NotifyName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.ReceiveBeginPlay
	 */
	struct ACharacterePrevisCustom_C_ReceiveBeginPlay_Params
	{	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.Play Anim chapeau
	 */
	struct ACharacterePrevisCustom_C_Play_Anim_chapeau_Params
	{	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.PlayMontage
	 */
	struct ACharacterePrevisCustom_C_PlayMontage_Params
	{
	public:
		EUpGunCosmeticType                                         Index;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.SpinKnife
	 */
	struct ACharacterePrevisCustom_C_SpinKnife_Params
	{	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.SwitchWeapon
	 */
	struct ACharacterePrevisCustom_C_SwitchWeapon_Params
	{
	public:
		EUpGunCosmeticType                                         WeaponToEquip;                                           // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.OnCosmeticsUpdated
	 */
	struct ACharacterePrevisCustom_C_OnCosmeticsUpdated_Params
	{	};

	/**
	 * Function CharacterePrevisCustom.CharacterePrevisCustom_C.ExecuteUbergraph_CharacterePrevisCustom
	 */
	struct ACharacterePrevisCustom_C_ExecuteUbergraph_CharacterePrevisCustom_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
