#pragma once

/**
 * Name: UpGun
 * Version: 0.5
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_Skill_Knife_Throw.GA_Skill_Knife_Throw_C.OnEvent_5C9CB2FF4D9505F0D058C3B940CEE015
	 */
	struct UGA_Skill_Knife_Throw_C_OnEvent_5C9CB2FF4D9505F0D058C3B940CEE015_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTag                                        Tag;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
		struct FGameplayEventData                                  EventData;                                               // 0x0010(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Skill_Knife_Throw.GA_Skill_Knife_Throw_C.OnInterrupted_5C9CB2FF4D9505F0D058C3B940CEE015
	 */
	struct UGA_Skill_Knife_Throw_C_OnInterrupted_5C9CB2FF4D9505F0D058C3B940CEE015_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTag                                        Tag;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
		struct FGameplayEventData                                  EventData;                                               // 0x0010(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Skill_Knife_Throw.GA_Skill_Knife_Throw_C.OnBlendOut_5C9CB2FF4D9505F0D058C3B940CEE015
	 */
	struct UGA_Skill_Knife_Throw_C_OnBlendOut_5C9CB2FF4D9505F0D058C3B940CEE015_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTag                                        Tag;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
		struct FGameplayEventData                                  EventData;                                               // 0x0010(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Skill_Knife_Throw.GA_Skill_Knife_Throw_C.OnCancelled_5C9CB2FF4D9505F0D058C3B940CEE015
	 */
	struct UGA_Skill_Knife_Throw_C_OnCancelled_5C9CB2FF4D9505F0D058C3B940CEE015_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTag                                        Tag;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
		struct FGameplayEventData                                  EventData;                                               // 0x0010(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Skill_Knife_Throw.GA_Skill_Knife_Throw_C.OnCompleted_5C9CB2FF4D9505F0D058C3B940CEE015
	 */
	struct UGA_Skill_Knife_Throw_C_OnCompleted_5C9CB2FF4D9505F0D058C3B940CEE015_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTag                                        Tag;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
		struct FGameplayEventData                                  EventData;                                               // 0x0010(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Skill_Knife_Throw.GA_Skill_Knife_Throw_C.K2_ActivateAbility
	 */
	struct UGA_Skill_Knife_Throw_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_Skill_Knife_Throw.GA_Skill_Knife_Throw_C.K2_OnEndAbility
	 */
	struct UGA_Skill_Knife_Throw_C_K2_OnEndAbility_Params
	{
	public:
		bool                                                       bWasCancelled;                                           // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Skill_Knife_Throw.GA_Skill_Knife_Throw_C.ExecuteUbergraph_GA_Skill_Knife_Throw
	 */
	struct UGA_Skill_Knife_Throw_C_ExecuteUbergraph_GA_Skill_Knife_Throw_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
