#pragma once

/**
 * Name: UpGun
 * Version: 0.5
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_Skill_ControlledExplosion.GA_Skill_ControlledExplosion_C.DidNotSpawn_299CDCB0438D1A3AEFB833A322EF8A75
	 */
	struct UGA_Skill_ControlledExplosion_C_DidNotSpawn_299CDCB0438D1A3AEFB833A322EF8A75_Params
	{
	public:
		class AActor*                                              SpawnedActor;                                            // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function GA_Skill_ControlledExplosion.GA_Skill_ControlledExplosion_C.Success_299CDCB0438D1A3AEFB833A322EF8A75
	 */
	struct UGA_Skill_ControlledExplosion_C_Success_299CDCB0438D1A3AEFB833A322EF8A75_Params
	{
	public:
		class AActor*                                              SpawnedActor;                                            // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function GA_Skill_ControlledExplosion.GA_Skill_ControlledExplosion_C.OnEvent_3D72C4C340100572999DA7BD3873A44A
	 */
	struct UGA_Skill_ControlledExplosion_C_OnEvent_3D72C4C340100572999DA7BD3873A44A_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTag                                        Tag;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
		struct FGameplayEventData                                  EventData;                                               // 0x0010(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Skill_ControlledExplosion.GA_Skill_ControlledExplosion_C.OnInterrupted_3D72C4C340100572999DA7BD3873A44A
	 */
	struct UGA_Skill_ControlledExplosion_C_OnInterrupted_3D72C4C340100572999DA7BD3873A44A_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTag                                        Tag;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
		struct FGameplayEventData                                  EventData;                                               // 0x0010(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Skill_ControlledExplosion.GA_Skill_ControlledExplosion_C.OnBlendOut_3D72C4C340100572999DA7BD3873A44A
	 */
	struct UGA_Skill_ControlledExplosion_C_OnBlendOut_3D72C4C340100572999DA7BD3873A44A_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTag                                        Tag;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
		struct FGameplayEventData                                  EventData;                                               // 0x0010(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Skill_ControlledExplosion.GA_Skill_ControlledExplosion_C.OnCancelled_3D72C4C340100572999DA7BD3873A44A
	 */
	struct UGA_Skill_ControlledExplosion_C_OnCancelled_3D72C4C340100572999DA7BD3873A44A_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTag                                        Tag;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
		struct FGameplayEventData                                  EventData;                                               // 0x0010(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Skill_ControlledExplosion.GA_Skill_ControlledExplosion_C.OnCompleted_3D72C4C340100572999DA7BD3873A44A
	 */
	struct UGA_Skill_ControlledExplosion_C_OnCompleted_3D72C4C340100572999DA7BD3873A44A_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTag                                        Tag;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
		struct FGameplayEventData                                  EventData;                                               // 0x0010(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Skill_ControlledExplosion.GA_Skill_ControlledExplosion_C.K2_ActivateAbility
	 */
	struct UGA_Skill_ControlledExplosion_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_Skill_ControlledExplosion.GA_Skill_ControlledExplosion_C.PlayMontage
	 */
	struct UGA_Skill_ControlledExplosion_C_PlayMontage_Params
	{	};

	/**
	 * Function GA_Skill_ControlledExplosion.GA_Skill_ControlledExplosion_C.ExecuteUbergraph_GA_Skill_ControlledExplosion
	 */
	struct UGA_Skill_ControlledExplosion_C_ExecuteUbergraph_GA_Skill_ControlledExplosion_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_J6P2[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
