#pragma once

/**
 * Name: UpGun
 * Version: 0.5
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_Skill_Decoy.GA_Skill_Decoy_C.DidNotSpawn_B7F6494C4E47B66E751A13A256792EA8
	 */
	struct UGA_Skill_Decoy_C_DidNotSpawn_B7F6494C4E47B66E751A13A256792EA8_Params
	{
	public:
		class AActor*                                              SpawnedActor;                                            // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function GA_Skill_Decoy.GA_Skill_Decoy_C.Success_B7F6494C4E47B66E751A13A256792EA8
	 */
	struct UGA_Skill_Decoy_C_Success_B7F6494C4E47B66E751A13A256792EA8_Params
	{
	public:
		class AActor*                                              SpawnedActor;                                            // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function GA_Skill_Decoy.GA_Skill_Decoy_C.OnEvent_84CD0ADA4E5DF94C9C8C44843F97B981
	 */
	struct UGA_Skill_Decoy_C_OnEvent_84CD0ADA4E5DF94C9C8C44843F97B981_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTag                                        Tag;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
		struct FGameplayEventData                                  EventData;                                               // 0x0010(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Skill_Decoy.GA_Skill_Decoy_C.OnInterrupted_84CD0ADA4E5DF94C9C8C44843F97B981
	 */
	struct UGA_Skill_Decoy_C_OnInterrupted_84CD0ADA4E5DF94C9C8C44843F97B981_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTag                                        Tag;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
		struct FGameplayEventData                                  EventData;                                               // 0x0010(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Skill_Decoy.GA_Skill_Decoy_C.OnBlendOut_84CD0ADA4E5DF94C9C8C44843F97B981
	 */
	struct UGA_Skill_Decoy_C_OnBlendOut_84CD0ADA4E5DF94C9C8C44843F97B981_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTag                                        Tag;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
		struct FGameplayEventData                                  EventData;                                               // 0x0010(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Skill_Decoy.GA_Skill_Decoy_C.OnCancelled_84CD0ADA4E5DF94C9C8C44843F97B981
	 */
	struct UGA_Skill_Decoy_C_OnCancelled_84CD0ADA4E5DF94C9C8C44843F97B981_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTag                                        Tag;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
		struct FGameplayEventData                                  EventData;                                               // 0x0010(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Skill_Decoy.GA_Skill_Decoy_C.OnCompleted_84CD0ADA4E5DF94C9C8C44843F97B981
	 */
	struct UGA_Skill_Decoy_C_OnCompleted_84CD0ADA4E5DF94C9C8C44843F97B981_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTag                                        Tag;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
		struct FGameplayEventData                                  EventData;                                               // 0x0010(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Skill_Decoy.GA_Skill_Decoy_C.K2_ActivateAbility
	 */
	struct UGA_Skill_Decoy_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_Skill_Decoy.GA_Skill_Decoy_C.ExecuteUbergraph_GA_Skill_Decoy
	 */
	struct UGA_Skill_Decoy_C_ExecuteUbergraph_GA_Skill_Decoy_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
