#pragma once

/**
 * Name: UpGun
 * Version: 0.5
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_Skill_ArmedReload.GA_Skill_ArmedReload_C.OnSync_F4E6381A4EA609CCFB726283F2A1273C
	 */
	struct UGA_Skill_ArmedReload_C_OnSync_F4E6381A4EA609CCFB726283F2A1273C_Params
	{	};

	/**
	 * Function GA_Skill_ArmedReload.GA_Skill_ArmedReload_C.OnEvent_AFE39BCB431D6213AF0B82B46D7CBA1F
	 */
	struct UGA_Skill_ArmedReload_C_OnEvent_AFE39BCB431D6213AF0B82B46D7CBA1F_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTag                                        Tag;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
		struct FGameplayEventData                                  EventData;                                               // 0x0010(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Skill_ArmedReload.GA_Skill_ArmedReload_C.OnInterrupted_AFE39BCB431D6213AF0B82B46D7CBA1F
	 */
	struct UGA_Skill_ArmedReload_C_OnInterrupted_AFE39BCB431D6213AF0B82B46D7CBA1F_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTag                                        Tag;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
		struct FGameplayEventData                                  EventData;                                               // 0x0010(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Skill_ArmedReload.GA_Skill_ArmedReload_C.OnBlendOut_AFE39BCB431D6213AF0B82B46D7CBA1F
	 */
	struct UGA_Skill_ArmedReload_C_OnBlendOut_AFE39BCB431D6213AF0B82B46D7CBA1F_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTag                                        Tag;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
		struct FGameplayEventData                                  EventData;                                               // 0x0010(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Skill_ArmedReload.GA_Skill_ArmedReload_C.OnCancelled_AFE39BCB431D6213AF0B82B46D7CBA1F
	 */
	struct UGA_Skill_ArmedReload_C_OnCancelled_AFE39BCB431D6213AF0B82B46D7CBA1F_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTag                                        Tag;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
		struct FGameplayEventData                                  EventData;                                               // 0x0010(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Skill_ArmedReload.GA_Skill_ArmedReload_C.OnCompleted_AFE39BCB431D6213AF0B82B46D7CBA1F
	 */
	struct UGA_Skill_ArmedReload_C_OnCompleted_AFE39BCB431D6213AF0B82B46D7CBA1F_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTag                                        Tag;                                                     // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
		struct FGameplayEventData                                  EventData;                                               // 0x0010(0x00B0)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function GA_Skill_ArmedReload.GA_Skill_ArmedReload_C.DidNotSpawn_30F4727043D8185A531611A45D5F2DF1
	 */
	struct UGA_Skill_ArmedReload_C_DidNotSpawn_30F4727043D8185A531611A45D5F2DF1_Params
	{
	public:
		class AActor*                                              SpawnedActor;                                            // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function GA_Skill_ArmedReload.GA_Skill_ArmedReload_C.Success_30F4727043D8185A531611A45D5F2DF1
	 */
	struct UGA_Skill_ArmedReload_C_Success_30F4727043D8185A531611A45D5F2DF1_Params
	{
	public:
		class AActor*                                              SpawnedActor;                                            // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function GA_Skill_ArmedReload.GA_Skill_ArmedReload_C.K2_ActivateAbility
	 */
	struct UGA_Skill_ArmedReload_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_Skill_ArmedReload.GA_Skill_ArmedReload_C.ExecuteUbergraph_GA_Skill_ArmedReload
	 */
	struct UGA_Skill_ArmedReload_C_ExecuteUbergraph_GA_Skill_ArmedReload_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_JK8Y[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
