#pragma once

/**
 * Name: UpGun
 * Version: 0.5
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_Skill_RepairKit.GA_Skill_RepairKit_C.DidNotSpawn_7AB4EDB84261535E2276C8980E17FD89
	 */
	struct UGA_Skill_RepairKit_C_DidNotSpawn_7AB4EDB84261535E2276C8980E17FD89_Params
	{
	public:
		class AActor*                                              SpawnedActor;                                            // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function GA_Skill_RepairKit.GA_Skill_RepairKit_C.Success_7AB4EDB84261535E2276C8980E17FD89
	 */
	struct UGA_Skill_RepairKit_C_Success_7AB4EDB84261535E2276C8980E17FD89_Params
	{
	public:
		class AActor*                                              SpawnedActor;                                            // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function GA_Skill_RepairKit.GA_Skill_RepairKit_C.EventReceived_797C1620478C14BD72EA0B8C95A49FC9
	 */
	struct UGA_Skill_RepairKit_C_EventReceived_797C1620478C14BD72EA0B8C95A49FC9_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_Skill_RepairKit.GA_Skill_RepairKit_C.K2_ActivateAbility
	 */
	struct UGA_Skill_RepairKit_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_Skill_RepairKit.GA_Skill_RepairKit_C.ExecuteUbergraph_GA_Skill_RepairKit
	 */
	struct UGA_Skill_RepairKit_C_ExecuteUbergraph_GA_Skill_RepairKit_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_IQJV[0xC];                                   // 0x0004(0x000C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
