#pragma once

/**
 * Name: UpGun
 * Version: 0.5
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function HUD_Debug.HUD_Debug_C.DebugText05
	 */
	struct UHUD_Debug_C_DebugText05_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function HUD_Debug.HUD_Debug_C.DebugText04
	 */
	struct UHUD_Debug_C_DebugText04_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function HUD_Debug.HUD_Debug_C.DebugText03
	 */
	struct UHUD_Debug_C_DebugText03_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function HUD_Debug.HUD_Debug_C.DebugText02
	 */
	struct UHUD_Debug_C_DebugText02_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function HUD_Debug.HUD_Debug_C.DebugText01
	 */
	struct UHUD_Debug_C_DebugText01_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function HUD_Debug.HUD_Debug_C.Construct
	 */
	struct UHUD_Debug_C_Construct_Params
	{	};

	/**
	 * Function HUD_Debug.HUD_Debug_C.OnSkillsUpdated
	 */
	struct UHUD_Debug_C_OnSkillsUpdated_Params
	{	};

	/**
	 * Function HUD_Debug.HUD_Debug_C.ExecuteUbergraph_HUD_Debug
	 */
	struct UHUD_Debug_C_ExecuteUbergraph_HUD_Debug_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_RCMF[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
