#pragma once

/**
 * Name: UpGun
 * Version: 0.5
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function SkillToBan.SkillToBan_C.CanAddNewSkill
	 */
	struct USkillToBan_C_CanAddNewSkill_Params
	{
	public:
		bool                                                       CanBan;                                                  // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_QL8L[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SkillToBan.SkillToBan_C.RefreshColors
	 */
	struct USkillToBan_C_RefreshColors_Params
	{	};

	/**
	 * Function SkillToBan.SkillToBan_C.Construct
	 */
	struct USkillToBan_C_Construct_Params
	{	};

	/**
	 * Function SkillToBan.SkillToBan_C.BndEvt__SkillToBan_Button_0_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	 */
	struct USkillToBan_C_BndEvt__SkillToBan_Button_0_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function SkillToBan.SkillToBan_C.BndEvt__SkillToBan_Button_0_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature
	 */
	struct USkillToBan_C_BndEvt__SkillToBan_Button_0_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function SkillToBan.SkillToBan_C.BndEvt__SkillToBan_Button_0_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature
	 */
	struct USkillToBan_C_BndEvt__SkillToBan_Button_0_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function SkillToBan.SkillToBan_C.PreConstruct
	 */
	struct USkillToBan_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SkillToBan.SkillToBan_C.ExecuteUbergraph_SkillToBan
	 */
	struct USkillToBan_C_ExecuteUbergraph_SkillToBan_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_7UMA[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
