#pragma once

/**
 * Name: UpGun
 * Version: 0.5
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UpGun.HorrorMultiplayerSyncComponent.OnRep_Transforms
	 */
	struct UHorrorMultiplayerSyncComponent_OnRep_Transforms_Params
	{	};

	/**
	 * Function UpGun.UpGunAbilitySystemComponent.ResetCooldowns
	 */
	struct UUpGunAbilitySystemComponent_ResetCooldowns_Params
	{	};

	/**
	 * Function UpGun.UpGunAbilitySystemComponent.RemoveGameplayCueLocal
	 */
	struct UUpGunAbilitySystemComponent_RemoveGameplayCueLocal_Params
	{
	public:
		struct FGameplayTag                                        GameplayCueTag;                                          // 0x0000(0x0008)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FGameplayCueParameters                              GameplayCueParameters;                                   // 0x0008(0x00B8)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilitySystemComponent.OnRep_ReplicatedAbilitiesMontages
	 */
	struct UUpGunAbilitySystemComponent_OnRep_ReplicatedAbilitiesMontages_Params
	{	};

	/**
	 * Function UpGun.UpGunAbilitySystemComponent.OnRep_CurrentReliableGameplayCues
	 */
	struct UUpGunAbilitySystemComponent_OnRep_CurrentReliableGameplayCues_Params
	{	};

	/**
	 * Function UpGun.UpGunAbilitySystemComponent.MulticastExecuteGameplayCue
	 */
	struct UUpGunAbilitySystemComponent_MulticastExecuteGameplayCue_Params
	{
	public:
		struct FGameplayTag                                        GameplayCueTag;                                          // 0x0000(0x0008)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilitySystemComponent.MulticastAddGameplayCue
	 */
	struct UUpGunAbilitySystemComponent_MulticastAddGameplayCue_Params
	{
	public:
		struct FGameplayTag                                        GameplayCueTag;                                          // 0x0000(0x0008)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FGameplayCueParameters                              GameplayCueParameters;                                   // 0x0008(0x00B8)  (ConstParm, Parm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilitySystemComponent.ExecuteReliableGameplayCue
	 */
	struct UUpGunAbilitySystemComponent_ExecuteReliableGameplayCue_Params
	{
	public:
		struct FGameplayTag                                        GameplayCueTag;                                          // 0x0000(0x0008)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilitySystemComponent.ExecuteGameplayCueLocal
	 */
	struct UUpGunAbilitySystemComponent_ExecuteGameplayCueLocal_Params
	{
	public:
		struct FGameplayTag                                        GameplayCueTag;                                          // 0x0000(0x0008)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FGameplayCueParameters                              GameplayCueParameters;                                   // 0x0008(0x00B8)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilitySystemComponent.BP_CancelAbility
	 */
	struct UUpGunAbilitySystemComponent_BP_CancelAbility_Params
	{
	public:
		class UClass*                                              Ability;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilitySystemComponent.AddReliableGameplayCue
	 */
	struct UUpGunAbilitySystemComponent_AddReliableGameplayCue_Params
	{
	public:
		struct FGameplayTag                                        GameplayCueTag;                                          // 0x0000(0x0008)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FGameplayCueParameters                              GameplayCueParameters;                                   // 0x0008(0x00B8)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilitySystemComponent.AddGameplayCueLocal
	 */
	struct UUpGunAbilitySystemComponent_AddGameplayCueLocal_Params
	{
	public:
		struct FGameplayTag                                        GameplayCueTag;                                          // 0x0000(0x0008)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FGameplayCueParameters                              GameplayCueParameters;                                   // 0x0008(0x00B8)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilitySystemComponent.AddAttributeSet
	 */
	struct UUpGunAbilitySystemComponent_AddAttributeSet_Params
	{
	public:
		class UAttributeSet*                                       Set;                                                     // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilitySystemWidget.ListenForGameplayTag
	 */
	struct UUpGunAbilitySystemWidget_ListenForGameplayTag_Params
	{
	public:
		EGameplayTagEventType                                      Type;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_XVW5[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FGameplayTag                                        Tag;                                                     // 0x0004(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      InEvent;                                                 // 0x000C(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x001C(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilitySystemWidget.ListenForAttributes
	 */
	struct UUpGunAbilitySystemWidget_ListenForAttributes_Params
	{
	public:
		TArray<struct FGameplayAttribute>                          Attributes;                                              // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      InEvent;                                                 // 0x0010(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       bInitialCall;                                            // 0x0020(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0021(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilitySystemWidget.ListenForAttribute
	 */
	struct UUpGunAbilitySystemWidget_ListenForAttribute_Params
	{
	public:
		struct FGameplayAttribute                                  Attribute;                                               // 0x0000(0x0038)  (Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      InEvent;                                                 // 0x0038(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       bInitialCall;                                            // 0x0048(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0049(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilityTask_ApplyComponentConstantRootMotion.ApplyComponentConstantRootMotion
	 */
	struct UUpGunAbilityTask_ApplyComponentConstantRootMotion_ApplyComponentConstantRootMotion_Params
	{
	public:
		class UGameplayAbility*                                    OwningAbility;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                TaskInstanceName;                                        // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class USceneComponent*                                     Component;                                               // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Strength;                                                // 0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Duration;                                                // 0x001C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bIsAdditive;                                             // 0x0020(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		ERootMotionFinishVelocityMode                              VelocityOnFinishMode;                                    // 0x0021(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_L6IW[0x2];                                   // 0x0022(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FVector                                             SetVelocityOnFinish;                                     // 0x0024(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ClampVelocityOnFinish;                                   // 0x0030(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bEnableGravity;                                          // 0x0034(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_VVK0[0x3];                                   // 0x0035(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UUpGunAbilityTask_ApplyComponentConstantRootMotion*  ReturnValue;                                             // 0x0038(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilityTask_JackRepeatAction.ContinuouslyRepeatAction
	 */
	struct UUpGunAbilityTask_JackRepeatAction_ContinuouslyRepeatAction_Params
	{
	public:
		class UGameplayAbility*                                    OwningAbility;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      TimeBetweenActions;                                      // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_S0J9[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UUpGunAbilityTask_JackRepeatAction*                  ReturnValue;                                             // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilityTask_PlayMontageForMeshAndWaitForEvent.PlayMontageForMeshAndWaitForEvent
	 */
	struct UUpGunAbilityTask_PlayMontageForMeshAndWaitForEvent_PlayMontageForMeshAndWaitForEvent_Params
	{
	public:
		class UGameplayAbility*                                    OwningAbility;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                TaskInstanceName;                                        // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class USkeletalMeshComponent*                              Mesh;                                                    // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UAnimMontage*                                        MontageToPlay;                                           // 0x0018(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FGameplayTagContainer                               EventTags;                                               // 0x0020(0x0020)  (Parm, NativeAccessSpecifierPublic)
		float                                                      Rate;                                                    // 0x0040(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                StartSection;                                            // 0x0044(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bStopWhenAbilityEnds;                                    // 0x004C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_WN0H[0x3];                                   // 0x004D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      AnimRootMotionTranslationScale;                          // 0x0050(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bReplicateMontage;                                       // 0x0054(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_OH7I[0x3];                                   // 0x0055(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      OverrideBlendOutTimeForCancelAbility;                    // 0x0058(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      OverrideBlendOutTimeForStopWhenEndAbility;               // 0x005C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UUpGunAbilityTask_PlayMontageForMeshAndWaitForEvent* ReturnValue;                                             // 0x0060(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilityTask_PlayWeaponMontage.PlayWeaponMontage
	 */
	struct UUpGunAbilityTask_PlayWeaponMontage_PlayWeaponMontage_Params
	{
	public:
		class UGameplayAbility*                                    OwningAbility;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                TaskInstanceName;                                        // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FGameplayTagContainer                               EventTags;                                               // 0x0010(0x0020)  (Parm, NativeAccessSpecifierPublic)
		class UAnimMontage*                                        MontageWeaponFPS;                                        // 0x0030(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UAnimMontage*                                        MontageWeaponTPS;                                        // 0x0038(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UAnimMontage*                                        MontageHandsFPS;                                         // 0x0040(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UAnimMontage*                                        MontageHandsTPS;                                         // 0x0048(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    MontagesToNotStopWhenAbilityEnds;                        // 0x0050(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      FPSPlayRate;                                             // 0x0054(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      TPSPlayRate;                                             // 0x0058(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_3PTX[0x4];                                   // 0x005C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UUpGunAbilityTask_PlayWeaponMontage*                 ReturnValue;                                             // 0x0060(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilityTask_SpawnProjectileClientSimulated.SpawnPredictedProjectile
	 */
	struct UUpGunAbilityTask_SpawnProjectileClientSimulated_SpawnPredictedProjectile_Params
	{
	public:
		class UGameplayAbility*                                    OwningAbility;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_MF2S[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FTransform                                          Transform;                                               // 0x0010(0x0030)  (Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FVector                                             Velocity;                                                // 0x0040(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_8OWV[0x4];                                   // 0x004C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UClass*                                              Class;                                                   // 0x0050(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UUpGunAbilityTask_SpawnProjectileClientSimulated*    ReturnValue;                                             // 0x0058(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilityTask_SpawnProjectileClientSimulated.FinishSpawningActor
	 */
	struct UUpGunAbilityTask_SpawnProjectileClientSimulated_FinishSpawningActor_Params
	{
	public:
		class UGameplayAbility*                                    OwningAbility;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FGameplayAbilityTargetDataHandle                    TargetData;                                              // 0x0008(0x0028)  (Parm, NativeAccessSpecifierPublic)
		class AUpGunProjectileClientSimulated*                     SpawnedActor;                                            // 0x0030(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilityTask_SpawnProjectileClientSimulated.BeginSpawningActor
	 */
	struct UUpGunAbilityTask_SpawnProjectileClientSimulated_BeginSpawningActor_Params
	{
	public:
		class UGameplayAbility*                                    OwningAbility;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FGameplayAbilityTargetDataHandle                    TargetData;                                              // 0x0008(0x0028)  (Parm, NativeAccessSpecifierPublic)
		class UClass*                                              Class;                                                   // 0x0030(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AUpGunProjectileClientSimulated*                     SpawnedActor;                                            // 0x0038(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0040(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilityTask_Tick.Tick
	 */
	struct UUpGunAbilityTask_Tick_Tick_Params
	{
	public:
		class UGameplayAbility*                                    OwningAbility;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                TaskInstanceName;                                        // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UUpGunAbilityTask_Tick*                              ReturnValue;                                             // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilityTask_WaitTargetDataNoDestroy.WaitTargetDataNoDestroyUsingActor
	 */
	struct UUpGunAbilityTask_WaitTargetDataNoDestroy_WaitTargetDataNoDestroyUsingActor_Params
	{
	public:
		class UGameplayAbility*                                    OwningAbility;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                TaskInstanceName;                                        // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EGameplayTargetingConfirmation                             ConfirmationType;                                        // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_Y0Y4[0x7];                                   // 0x0011(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AGameplayAbilityTargetActor*                         TargetActor;                                             // 0x0018(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UUpGunAbilityTask_WaitTargetDataNoDestroy*           ReturnValue;                                             // 0x0020(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilityTask_WaitTargetDataNoDestroy.WaitTargetDataNoDestroy
	 */
	struct UUpGunAbilityTask_WaitTargetDataNoDestroy_WaitTargetDataNoDestroy_Params
	{
	public:
		class UGameplayAbility*                                    OwningAbility;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                TaskInstanceName;                                        // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EGameplayTargetingConfirmation                             ConfirmationType;                                        // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_2CWC[0x7];                                   // 0x0011(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UClass*                                              Class;                                                   // 0x0018(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UUpGunAbilityTask_WaitTargetDataNoDestroy*           ReturnValue;                                             // 0x0020(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilityTask_WaitTargetDataNoDestroy.OnTargetDataReplicatedCancelledCallback
	 */
	struct UUpGunAbilityTask_WaitTargetDataNoDestroy_OnTargetDataReplicatedCancelledCallback_Params
	{	};

	/**
	 * Function UpGun.UpGunAbilityTask_WaitTargetDataNoDestroy.OnTargetDataReplicatedCallback
	 */
	struct UUpGunAbilityTask_WaitTargetDataNoDestroy_OnTargetDataReplicatedCallback_Params
	{
	public:
		struct FGameplayAbilityTargetDataHandle                    Data;                                                    // 0x0000(0x0028)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		struct FGameplayTag                                        ActivationTag;                                           // 0x0028(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilityTask_WaitTargetDataNoDestroy.OnTargetDataReadyCallback
	 */
	struct UUpGunAbilityTask_WaitTargetDataNoDestroy_OnTargetDataReadyCallback_Params
	{
	public:
		struct FGameplayAbilityTargetDataHandle                    Data;                                                    // 0x0000(0x0028)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilityTask_WaitTargetDataNoDestroy.OnTargetDataCancelledCallback
	 */
	struct UUpGunAbilityTask_WaitTargetDataNoDestroy_OnTargetDataCancelledCallback_Params
	{
	public:
		struct FGameplayAbilityTargetDataHandle                    Data;                                                    // 0x0000(0x0028)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilityTask_WaitTargetDataNoDestroy.FinishSpawningActor
	 */
	struct UUpGunAbilityTask_WaitTargetDataNoDestroy_FinishSpawningActor_Params
	{
	public:
		class UGameplayAbility*                                    OwningAbility;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AGameplayAbilityTargetActor*                         SpawnedActor;                                            // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunAbilityTask_WaitTargetDataNoDestroy.BeginSpawningActor
	 */
	struct UUpGunAbilityTask_WaitTargetDataNoDestroy_BeginSpawningActor_Params
	{
	public:
		class UGameplayAbility*                                    OwningAbility;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UClass*                                              Class;                                                   // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AGameplayAbilityTargetActor*                         SpawnedActor;                                            // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBaseCharacter.PlayAnimMontageOnMesh
	 */
	struct AUpGunBaseCharacter_PlayAnimMontageOnMesh_Params
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      InPlayRate;                                              // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                StartSectionName;                                        // 0x000C(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bStopAllMontages;                                        // 0x0014(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_O4D3[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      ReturnValue;                                             // 0x0018(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBaseCharacter.OnTeamUpdated
	 */
	struct AUpGunBaseCharacter_OnTeamUpdated_Params
	{
	public:
		struct FUpGunTeamId                                        Team;                                                    // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBaseCharacter.OnRep_bMovementsEnabled
	 */
	struct AUpGunBaseCharacter_OnRep_bMovementsEnabled_Params
	{	};

	/**
	 * Function UpGun.UpGunBaseCharacter.OnCosmeticSettingsUpdated
	 */
	struct AUpGunBaseCharacter_OnCosmeticSettingsUpdated_Params
	{
	public:
		struct FUpGunCosmeticSettings                              Settings;                                                // 0x0000(0x0060)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBaseCharacter.MulticastKill
	 */
	struct AUpGunBaseCharacter_MulticastKill_Params
	{
	public:
		struct FVector_NetQuantizeNormal                           InLastHitDirection;                                      // 0x0000(0x000C)  (ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBaseCharacter.Kill
	 */
	struct AUpGunBaseCharacter_Kill_Params
	{
	public:
		class AController*                                         Killer;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              DamageCauser;                                            // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBaseCharacter.EnableMovements
	 */
	struct AUpGunBaseCharacter_EnableMovements_Params
	{	};

	/**
	 * Function UpGun.UpGunBaseCharacter.DisableMovements
	 */
	struct AUpGunBaseCharacter_DisableMovements_Params
	{	};

	/**
	 * Function UpGun.UpGunBaseCharacter.ClientDamage
	 */
	struct AUpGunBaseCharacter_ClientDamage_Params
	{
	public:
		struct FGameplayEffectSpecForRPC                           Spec;                                                    // 0x0000(0x0078)  (ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
		float                                                      Amount;                                                  // 0x0078(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBaseCharacter.CanDamage
	 */
	struct AUpGunBaseCharacter_CanDamage_Params
	{
	public:
		class AUpGunBaseCharacter*                                 Other;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBaseCharacter.BP_OnSpawnDefaultPlayerWeapons
	 */
	struct AUpGunBaseCharacter_BP_OnSpawnDefaultPlayerWeapons_Params
	{	};

	/**
	 * Function UpGun.UpGunBaseCharacter.BP_Kill
	 */
	struct AUpGunBaseCharacter_BP_Kill_Params
	{
	public:
		class AController*                                         Killer;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              DamageCauser;                                            // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBaseCharacterAttributeSet.OnRep_WalkSpeed
	 */
	struct UUpGunBaseCharacterAttributeSet_OnRep_WalkSpeed_Params
	{
	public:
		struct FGameplayAttributeData                              OldWalkSpeed;                                            // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBaseCharacterAttributeSet.OnRep_OverHealth
	 */
	struct UUpGunBaseCharacterAttributeSet_OnRep_OverHealth_Params
	{
	public:
		struct FGameplayAttributeData                              OldOverHealth;                                           // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBaseCharacterAttributeSet.OnRep_MaxHealth
	 */
	struct UUpGunBaseCharacterAttributeSet_OnRep_MaxHealth_Params
	{
	public:
		struct FGameplayAttributeData                              OldMaxHealth;                                            // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBaseCharacterAttributeSet.OnRep_JumpVelocity
	 */
	struct UUpGunBaseCharacterAttributeSet_OnRep_JumpVelocity_Params
	{
	public:
		struct FGameplayAttributeData                              OldJumpVelocity;                                         // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBaseCharacterAttributeSet.OnRep_Health
	 */
	struct UUpGunBaseCharacterAttributeSet_OnRep_Health_Params
	{
	public:
		struct FGameplayAttributeData                              OldHealth;                                               // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBaseCharacterAttributeSet.OnRep_CrouchSpeed
	 */
	struct UUpGunBaseCharacterAttributeSet_OnRep_CrouchSpeed_Params
	{
	public:
		struct FGameplayAttributeData                              OldCrouchSpeed;                                          // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBaseCharacterAttributeSet.GetMaxOverHealth
	 */
	struct UUpGunBaseCharacterAttributeSet_GetMaxOverHealth_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBaseHUD.SwitchToUIInputs
	 */
	struct AUpGunBaseHUD_SwitchToUIInputs_Params
	{	};

	/**
	 * Function UpGun.UpGunBaseHUD.SwitchToGameOnlyInputs
	 */
	struct AUpGunBaseHUD_SwitchToGameOnlyInputs_Params
	{	};

	/**
	 * Function UpGun.UpGunBaseHUD.SwitchToGameAndUIInputs
	 */
	struct AUpGunBaseHUD_SwitchToGameAndUIInputs_Params
	{	};

	/**
	 * Function UpGun.UpGunBaseHUD.ShowWidget
	 */
	struct AUpGunBaseHUD_ShowWidget_Params
	{
	public:
		class UUserWidget*                                         Widget;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bNeedMouse;                                              // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bChangeVisibility;                                       // 0x0009(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bInputUIOnly;                                            // 0x000A(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bNonHitTestable;                                         // 0x000B(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBaseHUD.HideWidget
	 */
	struct AUpGunBaseHUD_HideWidget_Params
	{
	public:
		class UUserWidget*                                         Widget;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bForceHide;                                              // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bChangeVisibility;                                       // 0x0009(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bFromInputUIOnly;                                        // 0x000A(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBaseHUD.ForceFocusToViewport
	 */
	struct AUpGunBaseHUD_ForceFocusToViewport_Params
	{	};

	/**
	 * Function UpGun.UpGunBaseHUD.BP_CreateWidgets
	 */
	struct AUpGunBaseHUD_BP_CreateWidgets_Params
	{	};

	/**
	 * Function UpGun.UpGunBasePlayerController.SetTeam
	 */
	struct AUpGunBasePlayerController_SetTeam_Params
	{
	public:
		struct FUpGunTeamId                                        ID;                                                      // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerController.SetMouseSensitivity
	 */
	struct AUpGunBasePlayerController_SetMouseSensitivity_Params
	{
	public:
		float                                                      Sensitivity;                                             // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerController.ServerSetTeam
	 */
	struct AUpGunBasePlayerController_ServerSetTeam_Params
	{
	public:
		struct FUpGunTeamId                                        ID;                                                      // 0x0000(0x0001)  (ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerController.ServerSendMessage
	 */
	struct AUpGunBasePlayerController_ServerSendMessage_Params
	{
	public:
		struct FUpGunChatMessage                                   Message;                                                 // 0x0000(0x0028)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerController.ServerSendCosmeticSettings
	 */
	struct AUpGunBasePlayerController_ServerSendCosmeticSettings_Params
	{
	public:
		struct FUpGunCosmeticSettings                              CosmeticSettings;                                        // 0x0000(0x0060)  (ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerController.SendMessage
	 */
	struct AUpGunBasePlayerController_SendMessage_Params
	{
	public:
		struct FUpGunChatMessage                                   Message;                                                 // 0x0000(0x0028)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerController.SendCosmeticSettings
	 */
	struct AUpGunBasePlayerController_SendCosmeticSettings_Params
	{
	public:
		struct FUpGunCosmeticSettings                              CosmeticSettings;                                        // 0x0000(0x0060)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerController.ClientSendMessage
	 */
	struct AUpGunBasePlayerController_ClientSendMessage_Params
	{
	public:
		struct FUpGunChatMessage                                   Message;                                                 // 0x0000(0x0028)  (ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerController.ClientOnStartedPlaying
	 */
	struct AUpGunBasePlayerController_ClientOnStartedPlaying_Params
	{	};

	/**
	 * Function UpGun.UpGunBasePlayerController.ClientOnPlayerDamagedMe
	 */
	struct AUpGunBasePlayerController_ClientOnPlayerDamagedMe_Params
	{
	public:
		struct FGameplayEffectSpecForRPC                           EffectSpec;                                              // 0x0000(0x0078)  (ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
		float                                                      Amount;                                                  // 0x0078(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_W5E4[0x4];                                   // 0x007C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AUpGunBasePlayerState*                               Killer;                                                  // 0x0080(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerController.ClientOnDamagedOtherPlayer
	 */
	struct AUpGunBasePlayerController_ClientOnDamagedOtherPlayer_Params
	{
	public:
		struct FGameplayEffectSpecForRPC                           EffectSpec;                                              // 0x0000(0x0078)  (ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
		float                                                      Amount;                                                  // 0x0078(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_8PVH[0x4];                                   // 0x007C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AUpGunBasePlayerState*                               Victim;                                                  // 0x0080(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerController.ClientGivedScore
	 */
	struct AUpGunBasePlayerController_ClientGivedScore_Params
	{
	public:
		struct FGameplayTag                                        ScoreTag;                                                // 0x0000(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Score;                                                   // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_WRIW[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              Target;                                                  // 0x0010(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerState.SetState
	 */
	struct AUpGunBasePlayerState_SetState_Params
	{
	public:
		struct FGameplayTag                                        InState;                                                 // 0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerState.OnRep_Team
	 */
	struct AUpGunBasePlayerState_OnRep_Team_Params
	{	};

	/**
	 * Function UpGun.UpGunBasePlayerState.OnRep_State
	 */
	struct AUpGunBasePlayerState_OnRep_State_Params
	{
	public:
		struct FGameplayTag                                        InOldTag;                                                // 0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerState.OnRep_CosmeticSettings
	 */
	struct AUpGunBasePlayerState_OnRep_CosmeticSettings_Params
	{	};

	/**
	 * Function UpGun.UpGunBasePlayerState.IsSpectator
	 */
	struct AUpGunBasePlayerState_IsSpectator_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerState.IsInTheSameTeam
	 */
	struct AUpGunBasePlayerState_IsInTheSameTeam_Params
	{
	public:
		class AUpGunBasePlayerState*                               PS;                                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerState.GetWalkSpeed
	 */
	struct AUpGunBasePlayerState_GetWalkSpeed_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerState.GetTrueHealth
	 */
	struct AUpGunBasePlayerState_GetTrueHealth_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerState.GetMaxHealth
	 */
	struct AUpGunBasePlayerState_GetMaxHealth_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerState.GetJumpVelocity
	 */
	struct AUpGunBasePlayerState_GetJumpVelocity_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerState.GetHealth
	 */
	struct AUpGunBasePlayerState_GetHealth_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerState.GetCrouchSpeed
	 */
	struct AUpGunBasePlayerState_GetCrouchSpeed_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerState.GetCorrectPing
	 */
	struct AUpGunBasePlayerState_GetCorrectPing_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerState.GetCooldownInfosForTag
	 */
	struct AUpGunBasePlayerState_GetCooldownInfosForTag_Params
	{
	public:
		struct FGameplayTagContainer                               CooldownTags;                                            // 0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
		float                                                      TimeRemaining;                                           // 0x0020(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Duration;                                                // 0x0024(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0028(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerState.GetAbilityByUpGunHandle
	 */
	struct AUpGunBasePlayerState_GetAbilityByUpGunHandle_Params
	{
	public:
		struct FUpGunAbilitySpecHandle                             Handle;                                                  // 0x0000(0x0010)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
		class UUpGunGameplayAbility*                               ReturnValue;                                             // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerState.GetAbilityByHandle
	 */
	struct AUpGunBasePlayerState_GetAbilityByHandle_Params
	{
	public:
		struct FGameplayAbilitySpecHandle                          Handle;                                                  // 0x0000(0x0004)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_YDGK[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UUpGunGameplayAbility*                               ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerState.BP_SetPlayerName
	 */
	struct AUpGunBasePlayerState_BP_SetPlayerName_Params
	{
	public:
		class FString                                              Name;                                                    // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunBasePlayerState.AddKill
	 */
	struct AUpGunBasePlayerState_AddKill_Params
	{	};

	/**
	 * Function UpGun.UpGunBasePlayerState.AddDeath
	 */
	struct AUpGunBasePlayerState_AddDeath_Params
	{	};

	/**
	 * Function UpGun.UpGunBasePlayerState.AddAssist
	 */
	struct AUpGunBasePlayerState_AddAssist_Params
	{	};

	/**
	 * Function UpGun.UpGunChatManagerComponent.OnRep_Rooms
	 */
	struct UUpGunChatManagerComponent_OnRep_Rooms_Params
	{	};

	/**
	 * Function UpGun.UpGunChatManagerComponent.GetRoomByName
	 */
	struct UUpGunChatManagerComponent_GetRoomByName_Params
	{
	public:
		class FString                                              Name;                                                    // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FUpGunChatRoom                                      ReturnValue;                                             // 0x0010(0x0028)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunChatManagerComponent.GetRoomById
	 */
	struct UUpGunChatManagerComponent_GetRoomById_Params
	{
	public:
		struct FUpGunChatRoomId                                    ID;                                                      // 0x0000(0x0001)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_A00W[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FUpGunChatRoom                                      ReturnValue;                                             // 0x0008(0x0028)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunChatStatics.NotEqual_UpGunChatRoomId
	 */
	struct UUpGunChatStatics_NotEqual_UpGunChatRoomId_Params
	{
	public:
		struct FUpGunChatRoomId                                    A;                                                       // 0x0000(0x0001)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
		struct FUpGunChatRoomId                                    B;                                                       // 0x0001(0x0001)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0002(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunChatStatics.IsValid
	 */
	struct UUpGunChatStatics_IsValid_Params
	{
	public:
		struct FUpGunChatRoomId                                    ID;                                                      // 0x0000(0x0001)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function UpGun.UpGunChatStatics.GetChatMessageMaxLength
	 */
