#pragma once

/**
 * Name: UpGun
 * Version: 0.5
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class UpGun.HorrorMultiplayerSyncComponent
	 * Size -> 0x0040 (FullSize[0x00F0] - InheritedSize[0x00B0])
	 */
	class UHorrorMultiplayerSyncComponent : public UActorComponent
	{
	public:
		TArray<class FName>                                        ComponentName;                                           // 0x00B0(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		float                                                      UpdateFrequency;                                         // 0x00C0(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      UpdateTransformTolerence;                                // 0x00C4(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EHorrorSyncMode                                            SyncMode;                                                // 0x00C8(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BLP8[0x7];                                   // 0x00C9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<TWeakObjectPtr<class USceneComponent>>              SceneComponents;                                         // 0x00D0(0x0010) ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate
		TArray<struct FTransform>                                  SceneComponentsTransforms;                               // 0x00E0(0x0010) Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPrivate

	public:
		void OnRep_Transforms();
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunAbilitySystemComponent
	 * Size -> 0x0060 (FullSize[0x1368] - InheritedSize[0x1308])
	 */
	class UUpGunAbilitySystemComponent : public UAbilitySystemComponent
	{
	public:
		TArray<struct FUpGunGameplayAbilityLocalAnimMontageMesh>   LocalAbilitiesMontages;                                  // 0x1308(0x0010) ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate
		TArray<struct FUpGunGameplayAbilityReplicatedMontageMesh>  ReplicatedAbilitiesMontages;                             // 0x1318(0x0010) Net, ZeroConstructor, RepNotify, ContainsInstancedReference, NativeAccessSpecifierPrivate
		struct FGameplayTagContainer                               CurrentReliableGameplayCues;                             // 0x1328(0x0020) Net, RepNotify, NativeAccessSpecifierPrivate
		class FScriptMulticastDelegate                             OnAbilitiesUpdated;                                      // 0x1348(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnAbilityCommitted;                                      // 0x1358(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic

	public:
		void ResetCooldowns();
		void RemoveGameplayCueLocal(const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& GameplayCueParameters);
		void OnRep_ReplicatedAbilitiesMontages();
		void OnRep_CurrentReliableGameplayCues();
		void MulticastExecuteGameplayCue(const struct FGameplayTag& GameplayCueTag);
		void MulticastAddGameplayCue(const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& GameplayCueParameters);
		void ExecuteReliableGameplayCue(const struct FGameplayTag& GameplayCueTag);
		void ExecuteGameplayCueLocal(const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& GameplayCueParameters);
		void BP_CancelAbility(class UClass* Ability);
		void AddReliableGameplayCue(const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& GameplayCueParameters);
		void AddGameplayCueLocal(const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& GameplayCueParameters);
		void AddAttributeSet(class UAttributeSet* Set);
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunAbilitySystemWidget
	 * Size -> 0x0018 (FullSize[0x0278] - InheritedSize[0x0260])
	 */
	class UUpGunAbilitySystemWidget : public UUserWidget
	{
	public:
		class UAbilitySystemComponent*                             AbilitySystem;                                           // 0x0260(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_5RL4[0x10];                                  // 0x0268(0x0010) MISSED OFFSET (PADDING)

	public:
		bool ListenForGameplayTag(EGameplayTagEventType Type, const struct FGameplayTag& Tag, const class FScriptDelegate& InEvent);
		bool ListenForAttributes(TArray<struct FGameplayAttribute> Attributes, const class FScriptDelegate& InEvent, bool bInitialCall);
		bool ListenForAttribute(const struct FGameplayAttribute& Attribute, const class FScriptDelegate& InEvent, bool bInitialCall);
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunAbilityTask_ApplyComponentConstantRootMotion
	 * Size -> 0x0028 (FullSize[0x00E0] - InheritedSize[0x00B8])
	 */
	class UUpGunAbilityTask_ApplyComponentConstantRootMotion : public UAbilityTask_ApplyRootMotion_Base
	{
	public:
		class FScriptMulticastDelegate                             OnFinished;                                              // 0x00B8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate
		class USceneComponent*                                     Component;                                               // 0x00C8(0x0008) ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      Strength;                                                // 0x00D0(0x0004) Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      Duration;                                                // 0x00D4(0x0004) Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       bIsAdditive;                                             // 0x00D8(0x0001) Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       bEnableGravity;                                          // 0x00D9(0x0001) Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_F3EL[0x6];                                   // 0x00DA(0x0006) MISSED OFFSET (PADDING)

	public:
		class UUpGunAbilityTask_ApplyComponentConstantRootMotion* ApplyComponentConstantRootMotion(class UGameplayAbility* OwningAbility, const class FName& TaskInstanceName, class USceneComponent* Component, float Strength, float Duration, bool bIsAdditive, ERootMotionFinishVelocityMode VelocityOnFinishMode, const struct FVector& SetVelocityOnFinish, float ClampVelocityOnFinish, bool bEnableGravity);
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunAbilityTask_JackRepeatAction
	 * Size -> 0x0020 (FullSize[0x00A0] - InheritedSize[0x0080])
	 */
	class UUpGunAbilityTask_JackRepeatAction : public UAbilityTask
	{
	public:
		class FScriptMulticastDelegate                             OnPerformAction;                                         // 0x0080(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VHXC[0x10];                                  // 0x0090(0x0010) MISSED OFFSET (PADDING)

	public:
		class UUpGunAbilityTask_JackRepeatAction* ContinuouslyRepeatAction(class UGameplayAbility* OwningAbility, float TimeBetweenActions);
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunAbilityTask_PlayMontageForMeshAndWaitForEvent
	 * Size -> 0x00D0 (FullSize[0x0150] - InheritedSize[0x0080])
	 */
	class UUpGunAbilityTask_PlayMontageForMeshAndWaitForEvent : public UAbilityTask
	{
	public:
		class USkeletalMeshComponent*                              Mesh;                                                    // 0x0080(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UAnimMontage*                                        MontageToPlay;                                           // 0x0088(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FGameplayTagContainer                               EventTags;                                               // 0x0090(0x0020) NativeAccessSpecifierPrivate
		float                                                      Rate;                                                    // 0x00B0(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FName                                                StartSection;                                            // 0x00B4(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      AnimRootMotionTranslationScale;                          // 0x00BC(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       bStopWhenAbilityEnds;                                    // 0x00C0(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       bReplicateMontage;                                       // 0x00C1(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_YFKP[0x2];                                   // 0x00C2(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      OverrideBlendOutTimeForCancelAbility;                    // 0x00C4(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      OverrideBlendOutTimeForStopWhenEndAbility;               // 0x00C8(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_OM6X[0x34];                                  // 0x00CC(0x0034) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnCompleted;                                             // 0x0100(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnBlendOut;                                              // 0x0110(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnInterrupted;                                           // 0x0120(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnCancelled;                                             // 0x0130(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             EventReceived;                                           // 0x0140(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic

	public:
		class UUpGunAbilityTask_PlayMontageForMeshAndWaitForEvent* PlayMontageForMeshAndWaitForEvent(class UGameplayAbility* OwningAbility, const class FName& TaskInstanceName, class USkeletalMeshComponent* Mesh, class UAnimMontage* MontageToPlay, const struct FGameplayTagContainer& EventTags, float Rate, const class FName& StartSection, bool bStopWhenAbilityEnds, float AnimRootMotionTranslationScale, bool bReplicateMontage, float OverrideBlendOutTimeForCancelAbility, float OverrideBlendOutTimeForStopWhenEndAbility);
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunAbilityTask_PlayWeaponMontage
	 * Size -> 0x00F0 (FullSize[0x0170] - InheritedSize[0x0080])
	 */
	class UUpGunAbilityTask_PlayWeaponMontage : public UAbilityTask
	{
	public:
		class UAnimMontage*                                        MontageWeaponFPS;                                        // 0x0080(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UAnimMontage*                                        MontageWeaponTPS;                                        // 0x0088(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UAnimMontage*                                        MontageHandsFPS;                                         // 0x0090(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UAnimMontage*                                        MontageHandsTPS;                                         // 0x0098(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FGameplayTagContainer                               EventTags;                                               // 0x00A0(0x0020) NativeAccessSpecifierPrivate
		float                                                      FPSPlayRate;                                             // 0x00C0(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      TPSPlayRate;                                             // 0x00C4(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UUpGunAbilitySystemComponent*                        UpGunAbilitySystem;                                      // 0x00C8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class AUpGunBaseCharacter*                                 Character;                                               // 0x00D0(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class AUpGunWeapon*                                        Weapon;                                                  // 0x00D8(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		int32_t                                                    MontagesToNotStopWhenAbilityEnds;                        // 0x00E0(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_W9N6[0x34];                                  // 0x00E4(0x0034) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    FinishedMontages;                                        // 0x0118(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_FTI6[0x4];                                   // 0x011C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnCompleted;                                             // 0x0120(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnCancelled;                                             // 0x0130(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnBlendOut;                                              // 0x0140(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnInterrupted;                                           // 0x0150(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnEvent;                                                 // 0x0160(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic

	public:
		class UUpGunAbilityTask_PlayWeaponMontage* PlayWeaponMontage(class UGameplayAbility* OwningAbility, const class FName& TaskInstanceName, const struct FGameplayTagContainer& EventTags, class UAnimMontage* MontageWeaponFPS, class UAnimMontage* MontageWeaponTPS, class UAnimMontage* MontageHandsFPS, class UAnimMontage* MontageHandsTPS, int32_t MontagesToNotStopWhenAbilityEnds, float FPSPlayRate, float TPSPlayRate);
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunAbilityTask_SpawnProjectileClientSimulated
	 * Size -> 0x0060 (FullSize[0x00E0] - InheritedSize[0x0080])
	 */
	class UUpGunAbilityTask_SpawnProjectileClientSimulated : public UAbilityTask
	{
	public:
		class FScriptMulticastDelegate                             Success;                                                 // 0x0080(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate
		class FScriptMulticastDelegate                             DidNotSpawn;                                             // 0x0090(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_5QRO[0x40];                                  // 0x00A0(0x0040) MISSED OFFSET (PADDING)

	public:
		class UUpGunAbilityTask_SpawnProjectileClientSimulated* SpawnPredictedProjectile(class UGameplayAbility* OwningAbility, const struct FTransform& Transform, const struct FVector& Velocity, class UClass* Class);
		void FinishSpawningActor(class UGameplayAbility* OwningAbility, const struct FGameplayAbilityTargetDataHandle& TargetData, class AUpGunProjectileClientSimulated* SpawnedActor);
		bool BeginSpawningActor(class UGameplayAbility* OwningAbility, const struct FGameplayAbilityTargetDataHandle& TargetData, class UClass* Class, class AUpGunProjectileClientSimulated** SpawnedActor);
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunAbilityTask_Tick
	 * Size -> 0x0010 (FullSize[0x0090] - InheritedSize[0x0080])
	 */
	class UUpGunAbilityTask_Tick : public UAbilityTask
	{
	public:
		class FScriptMulticastDelegate                             OnTick;                                                  // 0x0080(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic

	public:
		class UUpGunAbilityTask_Tick* Tick(class UGameplayAbility* OwningAbility, const class FName& TaskInstanceName);
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunAbilityTask_WaitTargetDataNoDestroy
	 * Size -> 0x0040 (FullSize[0x00C0] - InheritedSize[0x0080])
	 */
	class UUpGunAbilityTask_WaitTargetDataNoDestroy : public UAbilityTask
	{
	public:
		class FScriptMulticastDelegate                             ValidData;                                               // 0x0080(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate
		class FScriptMulticastDelegate                             Cancelled;                                               // 0x0090(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate
		class UClass*                                              TargetClass;                                             // 0x00A0(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class AGameplayAbilityTargetActor*                         TargetActor;                                             // 0x00A8(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_KY7Z[0x10];                                  // 0x00B0(0x0010) MISSED OFFSET (PADDING)

	public:
		class UUpGunAbilityTask_WaitTargetDataNoDestroy* WaitTargetDataNoDestroyUsingActor(class UGameplayAbility* OwningAbility, const class FName& TaskInstanceName, EGameplayTargetingConfirmation ConfirmationType, class AGameplayAbilityTargetActor* TargetActor);
		class UUpGunAbilityTask_WaitTargetDataNoDestroy* WaitTargetDataNoDestroy(class UGameplayAbility* OwningAbility, const class FName& TaskInstanceName, EGameplayTargetingConfirmation ConfirmationType, class UClass* Class);
		void OnTargetDataReplicatedCancelledCallback();
		void OnTargetDataReplicatedCallback(const struct FGameplayAbilityTargetDataHandle& Data, const struct FGameplayTag& ActivationTag);
		void OnTargetDataReadyCallback(const struct FGameplayAbilityTargetDataHandle& Data);
		void OnTargetDataCancelledCallback(const struct FGameplayAbilityTargetDataHandle& Data);
		void FinishSpawningActor(class UGameplayAbility* OwningAbility, class AGameplayAbilityTargetActor* SpawnedActor);
		bool BeginSpawningActor(class UGameplayAbility* OwningAbility, class UClass* Class, class AGameplayAbilityTargetActor** SpawnedActor);
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunArena
	 * Size -> 0x0070 (FullSize[0x00A0] - InheritedSize[0x0030])
	 */
	class UUpGunArena : public UDataAsset
	{
	public:
		class FText                                                Name;                                                    // 0x0030(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic
		class UTexture2D*                                          Thumbnail;                                               // 0x0048(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              Level[0x28];                                             // 0x0050(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		struct FGameplayTagContainer                               GameModes;                                               // 0x0078(0x0020) Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic
		bool                                                       bIsAvailableInFreeVersion;                               // 0x0098(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YRPW[0x7];                                   // 0x0099(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunBaseCharacter
	 * Size -> 0x00C8 (FullSize[0x0580] - InheritedSize[0x04B8])
	 */
	class AUpGunBaseCharacter : public ACharacter
	{
	public:
		unsigned char                                              UnknownData_GFJ9[0x8];                                   // 0x04B8(0x0008) Fix Super Size
		unsigned char                                              UnknownData_M7CL[0x8];                                   // 0x04C0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UUpGunAbilitySystemComponent*                        AbilitySystem;                                           // 0x04C8(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UCameraComponent*                                    Camera;                                                  // 0x04D0(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USpringArmComponent*                                 HandsSpringArm;                                          // 0x04D8(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USkeletalMeshComponent*                              HandsFPS;                                                // 0x04E0(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UUpGunWeaponManagerComponent*                        WeaponManager;                                           // 0x04E8(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UUpGunCosmeticManager*                               CosmeticManager;                                         // 0x04F0(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USceneComponent*                                     HatRootComponent;                                        // 0x04F8(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UStaticMeshComponent*                                StaticScreen;                                            // 0x0500(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       bIsDead;                                                 // 0x0508(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_UO1F[0x7];                                   // 0x0509(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AUpGunBasePlayerState*                               UpGunPlayerState;                                        // 0x0510(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FUpGunTeamId                                        Team;                                                    // 0x0518(0x0001) BlueprintVisible, BlueprintReadOnly, Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_PUPA[0x3];                                   // 0x0519(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      StandingCapsuleRadiusScaled;                             // 0x051C(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      StandingCapsuleHalfHeightScaled;                         // 0x0520(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       bHasBindAbilitiesInput;                                  // 0x0524(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_UGAE[0x3];                                   // 0x0525(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector_NetQuantizeNormal                           HitDirectionBeforeDeath;                                 // 0x0528(0x000C) BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       bMovementsEnabled;                                       // 0x0534(0x0001) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_WLJ2[0x3];                                   // 0x0535(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AUpGunBasePlayerController*                          CurrentOrLastController;                                 // 0x0538(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FScriptMulticastDelegate                             OnCharacterKilled;                                       // 0x0540(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPlayerStateReplicated;                                 // 0x0550(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnCharacterLanded;                                       // 0x0560(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnDamaged;                                               // 0x0570(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic

	public:
		float PlayAnimMontageOnMesh(class UAnimMontage* Montage, float InPlayRate, const class FName& StartSectionName, bool bStopAllMontages);
		void OnTeamUpdated(const struct FUpGunTeamId& Team);
		void OnRep_bMovementsEnabled();
		void OnCosmeticSettingsUpdated(const struct FUpGunCosmeticSettings& Settings);
		void MulticastKill(const struct FVector_NetQuantizeNormal& InLastHitDirection);
		void Kill(class AController* Killer, class AActor* DamageCauser);
		void EnableMovements();
		void DisableMovements();
		void ClientDamage(const struct FGameplayEffectSpecForRPC& Spec, float Amount);
		bool CanDamage(class AUpGunBaseCharacter* Other);
		void BP_OnSpawnDefaultPlayerWeapons();
		void BP_Kill(class AController* Killer, class AActor* DamageCauser);
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunDamageAttributeSet
	 * Size -> 0x0018 (FullSize[0x0048] - InheritedSize[0x0030])
	 */
	class UUpGunDamageAttributeSet : public UAttributeSet
	{
	public:
		struct FGameplayAttributeData                              Damage;                                                  // 0x0030(0x0010) NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_H94M[0x8];                                   // 0x0040(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunBaseCharacterAttributeSet
	 * Size -> 0x0090 (FullSize[0x00D8] - InheritedSize[0x0048])
	 */
	class UUpGunBaseCharacterAttributeSet : public UUpGunDamageAttributeSet
	{
	public:
		struct FGameplayAttributeData                              Health;                                                  // 0x0048(0x0010) Net, RepNotify, NativeAccessSpecifierPublic
		struct FGameplayAttributeData                              OverHealth;                                              // 0x0058(0x0010) Net, RepNotify, NativeAccessSpecifierPublic
		struct FGameplayAttributeData                              MaxHealth;                                               // 0x0068(0x0010) Net, RepNotify, NativeAccessSpecifierPublic
		struct FGameplayAttributeData                              WalkSpeed;                                               // 0x0078(0x0010) Net, RepNotify, NativeAccessSpecifierPublic
		struct FGameplayAttributeData                              CrouchSpeed;                                             // 0x0088(0x0010) Net, RepNotify, NativeAccessSpecifierPublic
		struct FGameplayAttributeData                              JumpVelocity;                                            // 0x0098(0x0010) Net, RepNotify, NativeAccessSpecifierPublic
		struct FGameplayAttributeData                              HeadArmor;                                               // 0x00A8(0x0010) NativeAccessSpecifierPublic
		struct FGameplayAttributeData                              Armor;                                                   // 0x00B8(0x0010) NativeAccessSpecifierPublic
		struct FGameplayAttributeData                              FireResistance;                                          // 0x00C8(0x0010) NativeAccessSpecifierPublic

	public:
		void OnRep_WalkSpeed(const struct FGameplayAttributeData& OldWalkSpeed);
		void OnRep_OverHealth(const struct FGameplayAttributeData& OldOverHealth);
		void OnRep_MaxHealth(const struct FGameplayAttributeData& OldMaxHealth);
		void OnRep_JumpVelocity(const struct FGameplayAttributeData& OldJumpVelocity);
		void OnRep_Health(const struct FGameplayAttributeData& OldHealth);
		void OnRep_CrouchSpeed(const struct FGameplayAttributeData& OldCrouchSpeed);
		float GetMaxOverHealth();
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunBaseGameSession
	 * Size -> 0x0010 (FullSize[0x0248] - InheritedSize[0x0238])
	 */
	class AUpGunBaseGameSession : public AGameSession
	{
	public:
		TArray<struct FUniqueNetIdRepl>                            BannedPlayers;                                           // 0x0238(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunBaseHUD
	 * Size -> 0x0018 (FullSize[0x0328] - InheritedSize[0x0310])
	 */
	class AUpGunBaseHUD : public AHUD
	{
	public:
		TArray<struct FUpGunHUDWidgetContext>                      Widgets;                                                 // 0x0310(0x0010) ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate
		int32_t                                                    WidgetsNeedingMouse;                                     // 0x0320(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       bHasCreatedWidgets;                                      // 0x0324(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_7706[0x3];                                   // 0x0325(0x0003) MISSED OFFSET (PADDING)

	public:
		void SwitchToUIInputs();
		void SwitchToGameOnlyInputs();
		void SwitchToGameAndUIInputs();
		void ShowWidget(class UUserWidget* Widget, bool bNeedMouse, bool bChangeVisibility, bool bInputUIOnly, bool bNonHitTestable);
		void HideWidget(class UUserWidget* Widget, bool bForceHide, bool bChangeVisibility, bool bFromInputUIOnly);
		void ForceFocusToViewport();
		void BP_CreateWidgets();
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunBasePlayerController
	 * Size -> 0x00A0 (FullSize[0x0610] - InheritedSize[0x0570])
	 */
	class AUpGunBasePlayerController : public APlayerController
	{
	public:
		class UClass*                                              DeathCameraActorClass;                                   // 0x0570(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class AActor*                                              DeathCameraActor;                                        // 0x0578(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FUpGunSynchronizedTimer                             RespawnTimer;                                            // 0x0580(0x0018) BlueprintVisible, BlueprintReadOnly, Net, NoDestructor, NativeAccessSpecifierPrivate
		TArray<struct FUpGunPlayerControllerDamageEvent>           DamageEvents;                                            // 0x0598(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		class AUpGunBasePlayerState*                               PS;                                                      // 0x05A8(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_MTLX[0x20];                                  // 0x05B0(0x0020) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnAcknowledgedPossession;                                // 0x05D0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnDamagedPlayer;                                         // 0x05E0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnGivedScore;                                            // 0x05F0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnMessageReceived;                                       // 0x0600(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic

	public:
		void SetTeam(const struct FUpGunTeamId& ID);
		void SetMouseSensitivity(float Sensitivity);
		void ServerSetTeam(const struct FUpGunTeamId& ID);
		void ServerSendMessage(const struct FUpGunChatMessage& Message);
		void ServerSendCosmeticSettings(const struct FUpGunCosmeticSettings& CosmeticSettings);
		void SendMessage(const struct FUpGunChatMessage& Message);
		void SendCosmeticSettings(const struct FUpGunCosmeticSettings& CosmeticSettings);
		void ClientSendMessage(const struct FUpGunChatMessage& Message);
		void ClientOnStartedPlaying();
		void ClientOnPlayerDamagedMe(const struct FGameplayEffectSpecForRPC& EffectSpec, float Amount, class AUpGunBasePlayerState* Killer);
		void ClientOnDamagedOtherPlayer(const struct FGameplayEffectSpecForRPC& EffectSpec, float Amount, class AUpGunBasePlayerState* Victim);
		void ClientGivedScore(const struct FGameplayTag& ScoreTag, float Score, class AActor* Target);
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunBasePlayerState
	 * Size -> 0x0140 (FullSize[0x0460] - InheritedSize[0x0320])
	 */
	class AUpGunBasePlayerState : public APlayerState
	{
	public:
		unsigned char                                              UnknownData_7909[0x10];                                  // 0x0320(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UUpGunAbilitySystemComponent*                        AbilitySystem;                                           // 0x0330(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UUpGunSkillManagerComponent*                         SkillManager;                                            // 0x0338(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UUpGunStatManager*                                   StatManager;                                             // 0x0340(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UUpGunBaseCharacterAttributeSet*                     BaseCharacterAttributeSet;                               // 0x0348(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UUpGunWeaponAttributeSet*                            WeaponAttributeSet;                                      // 0x0350(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UDataTable*                                          DefaultDataTable;                                        // 0x0358(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		TArray<class UClass*>                                      DefaultAbilities;                                        // 0x0360(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate
		struct FUpGunTeamId                                        Team;                                                    // 0x0370(0x0001) BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_W4RV[0x3];                                   // 0x0371(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FGameplayTag                                        State;                                                   // 0x0374(0x0008) BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       bIsHost;                                                 // 0x037C(0x0001) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_5T1E[0x3];                                   // 0x037D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FUpGunCosmeticSettings                              CosmeticSettings;                                        // 0x0380(0x0060) BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPrivate
		int32_t                                                    Kills;                                                   // 0x03E0(0x0004) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		int32_t                                                    Deaths;                                                  // 0x03E4(0x0004) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		int32_t                                                    Assists;                                                 // 0x03E8(0x0004) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_U66Q[0x4];                                   // 0x03EC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnAbilitesUpdated;                                       // 0x03F0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnAttributesInitialized;                                 // 0x0400(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPlayerRespawned;                                       // 0x0410(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPlayerStateUpdated;                                    // 0x0420(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnTeamUpdated;                                           // 0x0430(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnScoreUpdated;                                          // 0x0440(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnCosmeticSettingsUpdated;                               // 0x0450(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic

	public:
		void SetState(const struct FGameplayTag& InState);
		void OnRep_Team();
		void OnRep_State(const struct FGameplayTag& InOldTag);
		void OnRep_CosmeticSettings();
		bool IsSpectator();
		bool IsInTheSameTeam(class AUpGunBasePlayerState* PS);
		float GetWalkSpeed();
		float GetTrueHealth();
		float GetMaxHealth();
		float GetJumpVelocity();
		float GetHealth();
		float GetCrouchSpeed();
		int32_t GetCorrectPing();
		bool GetCooldownInfosForTag(const struct FGameplayTagContainer& CooldownTags, float* TimeRemaining, float* Duration);
		class UUpGunGameplayAbility* GetAbilityByUpGunHandle(const struct FUpGunAbilitySpecHandle& Handle);
		class UUpGunGameplayAbility* GetAbilityByHandle(const struct FGameplayAbilitySpecHandle& Handle);
		void BP_SetPlayerName(const class FString& Name);
		void AddKill();
		void AddDeath();
		void AddAssist();
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunBasicDamageableActor
	 * Size -> 0x0020 (FullSize[0x0240] - InheritedSize[0x0220])
	 */
	class AUpGunBasicDamageableActor : public AActor
	{
	public:
		unsigned char                                              UnknownData_65IW[0x10];                                  // 0x0220(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UUpGunAbilitySystemComponent*                        AbilitySystem;                                           // 0x0230(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UUpGunDamageAttributeSet*                            DamageAttributeSet;                                      // 0x0238(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunBasicDamageableCharacter
	 * Size -> 0x0028 (FullSize[0x04E0] - InheritedSize[0x04B8])
	 */
	class AUpGunBasicDamageableCharacter : public ACharacter
	{
	public:
		unsigned char                                              UnknownData_7PCH[0x8];                                   // 0x04B8(0x0008) Fix Super Size
		unsigned char                                              UnknownData_GC52[0x8];                                   // 0x04C0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UUpGunAbilitySystemComponent*                        AbilitySystem;                                           // 0x04C8(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UUpGunDamageAttributeSet*                            DamageAttributeSet;                                      // 0x04D0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_6Q4D[0x8];                                   // 0x04D8(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunCharacterMovementComponent
	 * Size -> 0x0010 (FullSize[0x0B10] - InheritedSize[0x0B00])
	 */
	class UUpGunCharacterMovementComponent : public UCharacterMovementComponent
	{
	public:
		class AUpGunBaseCharacter*                                 UpGunOwner;                                              // 0x0B00(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_CXVS[0x8];                                   // 0x0B08(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunChatManagerComponent
	 * Size -> 0x0030 (FullSize[0x00E0] - InheritedSize[0x00B0])
	 */
	class UUpGunChatManagerComponent : public UActorComponent
	{
	public:
		TArray<struct FUpGunChatMessage>                           AwaitingMessages;                                        // 0x00B0(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		TArray<struct FUpGunChatRoom>                              Rooms;                                                   // 0x00C0(0x0010) Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPrivate
		class FScriptMulticastDelegate                             OnRoomsUpdated;                                          // 0x00D0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic

	public:
		void OnRep_Rooms();
		struct FUpGunChatRoom GetRoomByName(const class FString& Name);
		struct FUpGunChatRoom GetRoomById(const struct FUpGunChatRoomId& ID);
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunChatStatics
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UUpGunChatStatics : public UObject
	{
	public:
		bool NotEqual_UpGunChatRoomId(const struct FUpGunChatRoomId& A, const struct FUpGunChatRoomId& B);
		bool IsValid(const struct FUpGunChatRoomId& ID);
		int32_t GetChatMessageMaxLength();
		bool EqualEqual_UpGunChatRoomId(const struct FUpGunChatRoomId& A, const struct FUpGunChatRoomId& B);
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunCosmeticManager
	 * Size -> 0x0088 (FullSize[0x0138] - InheritedSize[0x00B0])
	 */
	class UUpGunCosmeticManager : public UActorComponent
	{
	public:
		class USceneComponent*                                     HatRootComponent;                                        // 0x00B0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class AActor*                                              HatActor;                                                // 0x00B8(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UMaterialInstanceDynamic*                            ArmorMat;                                                // 0x00C0(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UMaterialInstanceDynamic*                            ScreenMat;                                               // 0x00C8(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UMaterialInstanceDynamic*                            RifleMat;                                                // 0x00D0(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USkeletalMeshComponent*                              Mesh;                                                    // 0x00D8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USkeletalMeshComponent*                              HandsMesh;                                               // 0x00E0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UMeshComponent*                                      ScreenMesh;                                              // 0x00E8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USkeletalMeshComponent*                              RifleMesh;                                               // 0x00F0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USkeletalMesh*                                       DefaultRifleMesh;                                        // 0x00F8(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UMaterialInstanceDynamic*                            KnifeMat;                                                // 0x0100(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USkeletalMeshComponent*                              KnifeMesh;                                               // 0x0108(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USkeletalMesh*                                       DefaultKnifeMesh;                                        // 0x0110(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		int32_t                                                    ArmorMatIndex;                                           // 0x0118(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		int32_t                                                    ScreenMatIndex;                                          // 0x011C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FLinearColor                                        ArmorColor;                                              // 0x0120(0x0010) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       bShouldUseArmorColor;                                    // 0x0130(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_8M1Q[0x7];                                   // 0x0131(0x0007) MISSED OFFSET (PADDING)

	public:
		void UpdateCosmeticSettings(const struct FUpGunCosmeticSettings& Settings);
		void SetRifleMesh(class USkeletalMeshComponent* InMesh);
		void SetMesh(class USkeletalMeshComponent* InMesh, int32_t ArmorMaterialIndex, class UMeshComponent* InScreenMesh, int32_t ScreenMaterialIndex);
		void SetKnifeMesh(class USkeletalMeshComponent* InMesh);
		void SetHatRootComponent(class USceneComponent* InHatRootComponent);
		void SetHandsMesh(class USkeletalMeshComponent* InHandsMesh);
		void SetArmorColor(const struct FLinearColor& InColor);
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunCosmeticDeveloperSettings
	 * Size -> 0x0100 (FullSize[0x0138] - InheritedSize[0x0038])
	 */
	class UUpGunCosmeticDeveloperSettings : public UDeveloperSettings
	{
	public:
		unsigned char                                              EquipmentDT[0x28];                                       // 0x0038(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              ArmorsDT[0x28];                                          // 0x0060(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              ScreensDT[0x28];                                         // 0x0088(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              WeaponSkinsDT[0x28];                                     // 0x00B0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		TArray<struct FDataTableRowHandle>                         DefaultCosmetics;                                        // 0x00D8(0x0010) Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic
		TMap<EUpGunCosmeticType, struct FDataTableRowHandle>       DefaultItems;                                            // 0x00E8(0x0050) Edit, Config, DisableEditOnInstance, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class UpGun.UpGunCosmeticSubsystem
	 * Size -> 0x0200 (FullSize[0x0230] - InheritedSize[0x0030])
	 */
	class UUpGunCosmeticSubsystem : public UGameInstanceSubsystem
	{
	public:
		class UDataTable*                                          EquipmentsDT;                                            // 0x0030(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UDataTable*                                          ArmorsDT;                                                // 0x0038(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UDataTable*                                          ScreensDT;                                               // 0x0040(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UDataTable*                                          WeaponSkinsDT;                                           // 0x0048(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		TMap<class FString, class FName>                           EquipmentMap;                                            // 0x0050(0x0050) NativeAccessSpecifierPrivate
