#pragma once

/**
 * Name: UpGun
 * Version: 0.5
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function W_Options_SoundBar.W_Options_SoundBar_C.PreConstruct
	 */
	struct UW_Options_SoundBar_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function W_Options_SoundBar.W_Options_SoundBar_C.Construct
	 */
	struct UW_Options_SoundBar_C_Construct_Params
	{	};

	/**
	 * Function W_Options_SoundBar.W_Options_SoundBar_C.BndEvt__W_Options_SoundBar_Slider_256_K2Node_ComponentBoundEvent_1_OnMouseCaptureEndEvent__DelegateSignature
	 */
	struct UW_Options_SoundBar_C_BndEvt__W_Options_SoundBar_Slider_256_K2Node_ComponentBoundEvent_1_OnMouseCaptureEndEvent__DelegateSignature_Params
	{	};

	/**
	 * Function W_Options_SoundBar.W_Options_SoundBar_C.BndEvt__W_Options_SoundBar_Slider_256_K2Node_ComponentBoundEvent_3_OnControllerCaptureEndEvent__DelegateSignature
	 */
	struct UW_Options_SoundBar_C_BndEvt__W_Options_SoundBar_Slider_256_K2Node_ComponentBoundEvent_3_OnControllerCaptureEndEvent__DelegateSignature_Params
	{	};

	/**
	 * Function W_Options_SoundBar.W_Options_SoundBar_C.BndEvt__W_Options_SoundBar_Slider_256_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature
	 */
	struct UW_Options_SoundBar_C_BndEvt__W_Options_SoundBar_Slider_256_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature_Params
	{
	public:
		float                                                      Value;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_Options_SoundBar.W_Options_SoundBar_C.BndEvt__W_Options_SoundBar_CheckBox_263_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature
	 */
	struct UW_Options_SoundBar_C_BndEvt__W_Options_SoundBar_CheckBox_263_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function W_Options_SoundBar.W_Options_SoundBar_C.OnUnMuteUpdated
	 */
	struct UW_Options_SoundBar_C_OnUnMuteUpdated_Params
	{	};

	/**
	 * Function W_Options_SoundBar.W_Options_SoundBar_C.ExecuteUbergraph_W_Options_SoundBar
	 */
	struct UW_Options_SoundBar_C_ExecuteUbergraph_W_Options_SoundBar_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_JL8J[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
