#pragma once

/**
 * Name: UpGun
 * Version: 0.5
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function WID_Lobby_Deathmatch_MatchSettings.WID_Lobby_Deathmatch_MatchSettings_C.InitializeCounters
	 */
	struct UWID_Lobby_Deathmatch_MatchSettings_C_InitializeCounters_Params
	{	};

	/**
	 * Function WID_Lobby_Deathmatch_MatchSettings.WID_Lobby_Deathmatch_MatchSettings_C.Construct
	 */
	struct UWID_Lobby_Deathmatch_MatchSettings_C_Construct_Params
	{	};

	/**
	 * Function WID_Lobby_Deathmatch_MatchSettings.WID_Lobby_Deathmatch_MatchSettings_C.BndEvt__WID_Lobby_Deathmatch_MatchSettings_Button_Compteur_rounds_K2Node_ComponentBoundEvent_2_ClickedOnButtons__DelegateSignature
	 */
	struct UWID_Lobby_Deathmatch_MatchSettings_C_BndEvt__WID_Lobby_Deathmatch_MatchSettings_Button_Compteur_rounds_K2Node_ComponentBoundEvent_2_ClickedOnButtons__DelegateSignature_Params
	{
	public:
		int32_t                                                    Value;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WID_Lobby_Deathmatch_MatchSettings.WID_Lobby_Deathmatch_MatchSettings_C.BndEvt__WID_Lobby_Deathmatch_MatchSettings_Button_Compteur_temps_round_K2Node_ComponentBoundEvent_3_ClickedOnButtons__DelegateSignature
	 */
	struct UWID_Lobby_Deathmatch_MatchSettings_C_BndEvt__WID_Lobby_Deathmatch_MatchSettings_Button_Compteur_temps_round_K2Node_ComponentBoundEvent_3_ClickedOnButtons__DelegateSignature_Params
	{
	public:
		int32_t                                                    Value;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WID_Lobby_Deathmatch_MatchSettings.WID_Lobby_Deathmatch_MatchSettings_C.BndEvt__WID_Lobby_Deathmatch_MatchSettings_Button_Compteur_lifes_K2Node_ComponentBoundEvent_4_ClickedOnButtons__DelegateSignature
	 */
	struct UWID_Lobby_Deathmatch_MatchSettings_C_BndEvt__WID_Lobby_Deathmatch_MatchSettings_Button_Compteur_lifes_K2Node_ComponentBoundEvent_4_ClickedOnButtons__DelegateSignature_Params
	{
	public:
		int32_t                                                    Value;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WID_Lobby_Deathmatch_MatchSettings.WID_Lobby_Deathmatch_MatchSettings_C.BndEvt__WID_Lobby_Deathmatch_MatchSettings_Button_Compteur_selection_K2Node_ComponentBoundEvent_5_ClickedOnButtons__DelegateSignature
	 */
	struct UWID_Lobby_Deathmatch_MatchSettings_C_BndEvt__WID_Lobby_Deathmatch_MatchSettings_Button_Compteur_selection_K2Node_ComponentBoundEvent_5_ClickedOnButtons__DelegateSignature_Params
	{
	public:
		int32_t                                                    Value;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WID_Lobby_Deathmatch_MatchSettings.WID_Lobby_Deathmatch_MatchSettings_C.BndEvt__WID_Lobby_Deathmatch_MatchSettings_Button_Compteur_respawn_K2Node_ComponentBoundEvent_6_ClickedOnButtons__DelegateSignature
	 */
	struct UWID_Lobby_Deathmatch_MatchSettings_C_BndEvt__WID_Lobby_Deathmatch_MatchSettings_Button_Compteur_respawn_K2Node_ComponentBoundEvent_6_ClickedOnButtons__DelegateSignature_Params
	{
	public:
		int32_t                                                    Value;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WID_Lobby_Deathmatch_MatchSettings.WID_Lobby_Deathmatch_MatchSettings_C.ExecuteUbergraph_WID_Lobby_Deathmatch_MatchSettings
	 */
	struct UWID_Lobby_Deathmatch_MatchSettings_C_ExecuteUbergraph_WID_Lobby_Deathmatch_MatchSettings_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_O1EO[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
